const insuranceTypes = [
  {
    name: '健康险',
    price: 1500
  }, {
    name: '车险',
    price: 2500
  }, {
    name: '延误险',
    price: 500
  }, {
    name: '碎屏险',
    price: 100
  }
]

const provinces = ['浙江', '江苏', '广州', '河北', '四川', '山东', '湖北']

const phoneNo = ["130", "131", "132", "133", "135", "137", "138", "170", "187", "189"]

const familyNames = [
  "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
  "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
  "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
  "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
  "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
  "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
  "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
  "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
  "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
  "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹"
]

const givenNames = [
  "子璇", "淼", "国栋", "夫子", "瑞堂", "甜", "敏", "尚", "国贤", "贺祥", "晨涛",
  "昊轩", "易轩", "益辰", "益帆", "益冉", "瑾春", "瑾昆", "春齐", "杨", "文昊",
  "东东", "雄霖", "浩晨", "熙涵", "溶溶", "冰枫", "欣欣", "宜豪", "欣慧", "建政",
  "美欣", "淑慧", "文轩", "文杰", "欣源", "忠林", "榕润", "欣汝", "慧嘉", "新建",
  "建林", "亦菲", "林", "冰洁", "佳欣", "涵涵", "禹辰", "淳美", "泽惠", "伟洋",
  "涵越", "润丽", "翔", "淑华", "晶莹", "凌晶", "苒溪", "雨涵", "嘉怡", "佳毅",
  "子辰", "佳琪", "紫轩", "瑞辰", "昕蕊", "萌", "明远", "欣宜", "泽远", "欣怡",
  "佳怡", "佳惠", "晨茜", "晨璐", "运昊", "汝鑫", "淑君", "晶滢", "润莎", "榕汕",
  "佳钰", "佳玉", "晓庆", "一鸣", "语晨", "添池", "添昊", "雨泽", "雅晗", "雅涵",
  "清妍", "诗悦", "嘉乐", "晨涵", "天赫", "玥傲", "佳昊", "天昊", "萌萌", "若萌"
]

const products = [
  {
    name: '银行卡盗刷险',
    price: 5
  },{
    name: '电信诈骗资金损失险',
    price: 9.9
  },{
    name: '爱享e家 家财意外险',
    price: 188
  },{
    name: '小米手机意外保',
    price: 59
  },{
    name: '无人机第三者责任险',
    price: 70
  },{
    name: '购省心',
    price: 50
  },{
    name: '任性退',
    price: 9.9
  },{
    name: '东南亚旅游意外险',
    price: 10
  },{
    name: '境内旅游意外险',
    price: 5
  },{
    name: '飞享e生 出行综合保障险',
    price: 79
  },{
    name: '飞享日本旅行险',
    price: 40
  },{
    name: '短途及周边游',
    price: 5
  },{
    name: '驴友旅行意外伤害保险',
    price: 5
  },{
    name: '台湾旅行意外险',
    price: 15
  },{
    name: '个人综合意外险',
    price: 45
  },{
    name: '骑行保共享单车意外险',
    price: 5
  },{
    name: '私家车驾驶员意外险',
    price: 1
  },{
    name: '成人百万综合意外险',
    price: 36
  },{
    name: '全民运动健身综合意外险',
    price: 5
  },{
    name: '成人综合意外险',
    price: 12
  },{
    name: '尊享e生·医疗险',
    price: 99
  },{
    name: '尊享e生2017版',
    price: 136
  },{
    name: '尊享e生·全保通（经典版）',
    price: 239
  },{
    name: '女性专属疾病险',
    price: 20
  },{
    name: '儿童重大疾病险',
    price: 34
  },{
    name: '尊享e生·全保通（旗舰版）',
    price: 460
  },{
    name: '成人重大疾病保险',
    price: 86
  },{
    name: '个人住院医疗险',
    price: 108
  },{
    name: '肠命百岁预防肠癌险',
    price: 996
  },{
    name: '好孕保',
    price: 60
  },{
    name: '儿童白血病疾病保险',
    price: 5
  },{
    name: '车险',
    price: 2500
  },{
    name: '个人住院医疗险',
    price: 108
  },{
    name: '延误险',
    price: 500
  },{
    name: '碎屏险',
    price: 100
  }
]

module.exports = {
  insuranceTypes,
  provinces,
  phoneNo,
  familyNames,
  givenNames,
  products
}